Ran Apply for project: `github` dir: `apps/github` workspace: `github`

**Apply Error**
<details><summary>Show Output</summary>

```
running "/usr/local/bin/terraform apply -input=false -no-color" in "/atlantis-data/repos/mvaldes14/terraform/43/github/apps/github": exit status 1
Running apply in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/elxilote/github/runs/run-fjPZmtM9p4cLFHak

Waiting for the plan to start...

Terraform v1.5.7
on linux_amd64
Initializing plugins and modules...
github_actions_secret.telegram_to: Refreshing state... [id=ansible_playbooks:TELEGRAM_TO]
github_actions_secret.ansible_vault_password: Refreshing state... [id=ansible_playbooks:ANSIBLE_VAULT_PASSWORD]
github_actions_secret.dockerhub_token["meal-notifier"]: Refreshing state... [id=meal-notifier:DOCKERHUB_TOKEN]
github_actions_secret.dockerhub_token["twitch-bot"]: Refreshing state... [id=twitch-bot:DOCKERHUB_TOKEN]
github_repository.repo["linear.nvim"]: Refreshing state... [id=linear.nvim]
github_repository.repo["deckmaster-config"]: Refreshing state... [id=deckmaster-config]
github_repository.repo["k8s-apps"]: Refreshing state... [id=k8s-apps]
github_repository.repo["meal-notifier"]: Refreshing state... [id=meal-notifier]
github_repository.repo["dotfiles-nix"]: Refreshing state... [id=dotfiles-nix]
github_repository.repo["chef"]: Refreshing state... [id=chef]
github_repository.repo["twitch-bot"]: Refreshing state... [id=twitch-bot]
github_repository.repo["api-go-otel-fuego"]: Refreshing state... [id=api-go-otel-fuego]
github_repository.repo["ansible_playbooks"]: Refreshing state... [id=ansible_playbooks]
github_repository.repo["obs-go-cli"]: Refreshing state... [id=obs-go-cli]
github_repository.repo["pulumi"]: Refreshing state... [id=pulumi]
github_repository.repo["dotfiles"]: Refreshing state... [id=dotfiles]
github_repository.repo["obs-wiki"]: Refreshing state... [id=obs-wiki]
github_actions_secret.dockerhub_username["twitch-bot"]: Refreshing state... [id=twitch-bot:DOCKERHUB_USERNAME]
github_actions_secret.dockerhub_username["meal-notifier"]: Refreshing state... [id=meal-notifier:DOCKERHUB_USERNAME]
github_actions_secret.telegram_chat: Refreshing state... [id=ansible_playbooks:TELEGRAM_TOKEN]
github_actions_secret.ansible_vault_password: Drift detected (delete)
github_actions_secret.dockerhub_token["meal-notifier"]: Drift detected (delete)
github_actions_secret.dockerhub_token["twitch-bot"]: Drift detected (delete)
github_actions_secret.dockerhub_username["meal-notifier"]: Drift detected (delete)
github_actions_secret.dockerhub_username["twitch-bot"]: Drift detected (delete)
github_actions_secret.telegram_chat: Drift detected (delete)
github_actions_secret.telegram_to: Drift detected (delete)
github_repository.repo["obs-go-cli"]: Drift detected (update)
github_repository.repo["pulumi"]: Drift detected (update)
github_repository.repo["api-go-otel-fuego"]: Drift detected (update)
github_repository.repo["k8s-apps"]: Drift detected (update)
github_repository.repo["ansible_playbooks"]: Drift detected (update)
github_repository.repo["linear.nvim"]: Drift detected (update)
github_repository.repo["dotfiles"]: Drift detected (update)
github_repository.repo["meal-notifier"]: Drift detected (update)
github_repository.repo["dotfiles-nix"]: Drift detected (update)
github_repository.repo["obs-wiki"]: Drift detected (delete)
github_repository.repo["chef"]: Drift detected (update)
github_repository.repo["twitch-bot"]: Drift detected (update)
github_repository.repo["deckmaster-config"]: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # github_actions_secret.ansible_vault_password will be created
  + resource "github_actions_secret" "ansible_vault_password" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "ansible_playbooks"
      + secret_name     = "ANSIBLE_VAULT_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.dockerhub_token["meal-notifier"] will be created
  + resource "github_actions_secret" "dockerhub_token" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "meal-notifier"
      + secret_name     = "DOCKERHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.dockerhub_token["twitch-bot"] will be created
  + resource "github_actions_secret" "dockerhub_token" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "twitch-bot"
      + secret_name     = "DOCKERHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.dockerhub_username["meal-notifier"] will be created
  + resource "github_actions_secret" "dockerhub_username" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "meal-notifier"
      + secret_name     = "DOCKERHUB_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.dockerhub_username["twitch-bot"] will be created
  + resource "github_actions_secret" "dockerhub_username" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "twitch-bot"
      + secret_name     = "DOCKERHUB_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.telegram_chat["meal-notifier"] will be created
  + resource "github_actions_secret" "telegram_chat" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "meal-notifier"
      + secret_name     = "TELEGRAM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.telegram_chat["twitch-bot"] will be created
  + resource "github_actions_secret" "telegram_chat" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "twitch-bot"
      + secret_name     = "TELEGRAM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.telegram_to["meal-notifier"] will be created
  + resource "github_actions_secret" "telegram_to" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "meal-notifier"
      + secret_name     = "TELEGRAM_TO"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.telegram_to["twitch-bot"] will be created
  + resource "github_actions_secret" "telegram_to" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "twitch-bot"
      + secret_name     = "TELEGRAM_TO"
      + updated_at      = (known after apply)
    }

  # github_repository.repo["ansible_playbooks"] will be updated in-place
  ~ resource "github_repository" "repo" {
      ~ allow_merge_commit          = false -> true
      ~ allow_rebase_merge          = false -> true
      ~ allow_squash_merge          = false -> true
        id                          = "ansible_playbooks"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "ansible_playbooks"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      ~ vulnerability_alerts        = false -> true
        # (26 unchanged attributes hidden)
    }

  # github_repository.repo["api-go-otel-fuego"] will be destroyed
  - resource "github_repository" "repo" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = false -> null
      - allow_rebase_merge          = false -> null
      - allow_squash_merge          = false -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = false -> null
      - etag                        = "W/\"a970ce6ed0a631684fd0dd980c8eac41651c9ef1ae670f9d4cb194f0f6cd3750\"" -> null
      - full_name                   = "mvaldes14/api-go-otel" -> null
      - git_clone_url               = "git://github.com/mvaldes14/api-go-otel.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = false -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/mvaldes14/api-go-otel" -> null
      - http_clone_url              = "https://github.com/mvaldes14/api-go-otel.git" -> null
      - id                          = "api-go-otel-fuego" -> null
      - is_template                 = false -> null
      - license_template            = "MIT" -> null
      - name                        = "api-go-otel-fuego" -> null
      - node_id                     = "R_kgDOLTH5sg" -> null
      - primary_language            = "Go" -> null
      - private                     = false -> null
      - repo_id                     = 758249906 -> null
      - ssh_clone_url               = "git@github.com:mvaldes14/api-go-otel.git" -> null
      - svn_url                     = "https://github.com/mvaldes14/api-go-otel" -> null
      - topics                      = [
          - "homelab",
        ] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = false -> null
      - web_commit_signoff_required = false -> null
    }

  # github_repository.repo["chef"] will be updated in-place
  ~ resource "github_repository" "repo" {
      ~ allow_merge_commit          = false -> true
      ~ allow_rebase_merge          = false -> true
      ~ allow_squash_merge          = false -> true
        id                          = "chef"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "chef"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      ~ vulnerability_alerts        = false -> true
        # (26 unchanged attributes hidden)
    }

  # github_repository.repo["deckmaster-config"] will be updated in-place
  ~ resource "github_repository" "repo" {
      ~ allow_merge_commit          = false -> true
      ~ allow_rebase_merge          = false -> true
      ~ allow_squash_merge          = false -> true
        id                          = "deckmaster-config"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "deckmaster-config"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      ~ vulnerability_alerts        = false -> true
        # (25 unchanged attributes hidden)
    }

  # github_repository.repo["dotfiles"] will be updated in-place
  ~ resource "github_repository" "repo" {
      ~ allow_merge_commit          = false -> true
      ~ allow_rebase_merge          = false -> true
      ~ allow_squash_merge          = false -> true
        id                          = "dotfiles"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "dotfiles"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      ~ vulnerability_alerts        = false -> true
        # (26 unchanged attributes hidden)
    }

  # github_repository.repo["dotfiles-nix"] will be updated in-place
  ~ resource "github_repository" "repo" {
      ~ allow_merge_commit          = false -> true
      ~ allow_rebase_merge          = false -> true
      ~ allow_squash_merge          = false -> true
        id                          = "dotfiles-nix"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "dotfiles-nix"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      ~ vulnerability_alerts        = false -> true
        # (26 unchanged attributes hidden)
    }

  # github_repository.repo["k8s-apps"] will be updated in-place
  ~ resource "github_repository" "repo" {
      ~ allow_merge_commit          = false -> true
      ~ allow_rebase_merge          = false -> true
      ~ allow_squash_merge          = false -> true
        id                          = "k8s-apps"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "k8s-apps"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      ~ vulnerability_alerts        = false -> true
        # (26 unchanged attributes hidden)
    }

  # github_repository.repo["linear.nvim"] will be updated in-place
  ~ resource "github_repository" "repo" {
      ~ allow_merge_commit          = false -> true
      ~ allow_rebase_merge          = false -> true
      ~ allow_squash_merge          = false -> true
        id                          = "linear.nvim"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "linear.nvim"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      ~ vulnerability_alerts        = false -> true
        # (26 unchanged attributes hidden)
    }

  # github_repository.repo["meal-notifier"] will be updated in-place
  ~ resource "github_repository" "repo" {
      ~ allow_merge_commit          = false -> true
      ~ allow_rebase_merge          = false -> true
      ~ allow_squash_merge          = false -> true
        id                          = "meal-notifier"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "meal-notifier"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      ~ vulnerability_alerts        = false -> true
        # (26 unchanged attributes hidden)
    }

  # github_repository.repo["obs-go-cli"] will be destroyed
  - resource "github_repository" "repo" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = false -> null
      - allow_rebase_merge          = false -> null
      - allow_squash_merge          = false -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = false -> null
      - etag                        = "W/\"f67f107e69dd70f20b76748aa8126b12f5aa254ac282c2cb13a685977f22db8d\"" -> null
      - full_name                   = "mvaldes14/obs-go-cli" -> null
      - git_clone_url               = "git://github.com/mvaldes14/obs-go-cli.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = false -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/mvaldes14/obs-go-cli" -> null
      - http_clone_url              = "https://github.com/mvaldes14/obs-go-cli.git" -> null
      - id                          = "obs-go-cli" -> null
      - is_template                 = false -> null
      - license_template            = "MIT" -> null
      - name                        = "obs-go-cli" -> null
      - node_id                     = "R_kgDOLFXWuA" -> null
      - primary_language            = "Go" -> null
      - private                     = false -> null
      - repo_id                     = 743823032 -> null
      - ssh_clone_url               = "git@github.com:mvaldes14/obs-go-cli.git" -> null
      - svn_url                     = "https://github.com/mvaldes14/obs-go-cli" -> null
      - topics                      = [
          - "homelab",
        ] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = false -> null
      - web_commit_signoff_required = false -> null
    }

  # github_repository.repo["pulumi"] will be updated in-place
  ~ resource "github_repository" "repo" {
      ~ allow_merge_commit          = false -> true
      ~ allow_rebase_merge          = false -> true
      ~ allow_squash_merge          = false -> true
        id                          = "pulumi"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "pulumi"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      ~ vulnerability_alerts        = false -> true
        # (26 unchanged attributes hidden)
    }

  # github_repository.repo["twitch-bot"] will be updated in-place
  ~ resource "github_repository" "repo" {
      ~ allow_merge_commit          = false -> true
      ~ allow_rebase_merge          = false -> true
      ~ allow_squash_merge          = false -> true
        id                          = "twitch-bot"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "twitch-bot"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      ~ vulnerability_alerts        = false -> true
        # (26 unchanged attributes hidden)
    }

Plan: 9 to add, 10 to change, 2 to destroy.

Error: Cannot confirm apply due to -input=false. Please handle run confirmation in the UI.

```
</details>